//-----------------------------------------------------------------------------
//
// スカイボックスの処理 ヘッダー [skybox.h]
// Author: Souta Tomoe
//
//-----------------------------------------------------------------------------
#ifndef _SKYBOX_H_
#define _SKYBOX_H_
#include "main.h"

//-----------------------------------------------------------------------------
// マクロ定義
//-----------------------------------------------------------------------------
#define SKYBOX_FACE_WIDTH (25600.0f / 2)
#define SKYBOX_FACE_HEIGHT (25600.0f / 2)
#define SKYBOX_FACE_DISTANCE (12800.0f / 2)

//-----------------------------------------------------------------------------
// Skybox構造体
//-----------------------------------------------------------------------------
typedef struct
{
	D3DXMATRIX mtxWorld;	// ワールドマトリックス
	D3DXVECTOR3 pos;		// 位置
	D3DXVECTOR3 rot;		// 向き
	bool bDraw;				// 描画するか
} Skybox;

//-----------------------------------------------------------------------------
// プロトタイプ宣言
//-----------------------------------------------------------------------------
HRESULT InitSky(void);
void UninitSky(void);
void UpdateSky(void);
void DrawSky(void);
void SetSky(D3DXVECTOR3 pos, D3DXVECTOR3 rot, int nIdx);
#endif