//-----------------------------------------------------------------------------
//
// モデルの処理 ヘッダー [model.h]
// Author: Souta Tomoe
//
//-----------------------------------------------------------------------------
#ifndef _MODEL_H_
#define _MODEL_H_

#include "main.h"

//-----------------------------------------------------------------------------
// マクロ定義
//-----------------------------------------------------------------------------
#define MODEL_MOVESPEED (1.0f)													// モデルの移動速度
#define MODEL_SMOOTHTURNSPEED (0.1f)											// モデルを滑らかに回転させる速度 (0.0f ~ 1.0f)

//-----------------------------------------------------------------------------
// モデルの構造体
//-----------------------------------------------------------------------------
typedef struct
{
	D3DXMATRIX mtxWorld;
	D3DXVECTOR3 pos;
	D3DXVECTOR3 rot;
	D3DXVECTOR3 rotDest;
} Model;
//-----------------------------------------------------------------------------
// プロトタイプ宣言
//-----------------------------------------------------------------------------
void InitModel(void);
void UninitModel(void);
void UpdateModel(void);
void DrawModel(void);
Model *GetModel(void);
D3DXVECTOR3 *GetVariableTest(void);

#endif