//===========================================================================================================
//
// 弾の設定 [bullet.h]
// Author: fukuyama syuya
//
//===========================================================================================================
#ifndef _BULLET_H_
#define _BULLET_H_

#include "main.h"

//=================================================================================================
//弾の列挙型
//=================================================================================================
typedef enum
{
	PLAYER_BULLET = 0,					//プレイヤーの弾
	ENEMY_BULLET,						//敵の弾
	MAX_BULLET,
}BULLETTYPE;

//=================================================================================================
//弾の構造体
//=================================================================================================
typedef struct
{
	D3DXVECTOR3 pos;																			//位置
	D3DXVECTOR3 move;																			//移動量
	D3DXCOLOR cor;																				//弾の色
	BULLETTYPE type;																			//弾の種類
	int nLife;																					//寿命																			//弾のダメージ量
	bool bUse;																					//使用しているかどうか																			//種類
}BULLET;

//===========================================================================================================
// プロトタイプ宣言
//===========================================================================================================
HRESULT InitBullet(void);
void UninitBullet(void);
void UpdateBullet(void);
void DrawBullet(void);
void SetBullet(D3DXVECTOR3 pos, D3DXVECTOR3 move, int nLife, BULLETTYPE type);
BULLET *GetBullet(void);

#endif
