////===================================================================
////
//// モデルの処理　[model.h]
//// Author: fukuyama syuya
////
////===================================================================
//#ifndef _MODEL_H_
//#define _MODEL_H_
//
//#include "main.h"
//
////===========================================================================================================
//// モデルの構造体
////===========================================================================================================
//typedef struct
//{
//	D3DXVECTOR3 pos;					//モデルの位置
//	D3DXVECTOR3 posDest;				//目的のモデルの位置
//	D3DXVECTOR3 rot;					//モデルの向き
//	D3DXVECTOR3 rotDest;				//目的のモデルの向き
//	D3DXMATRIX g_mtxWorldModel;			//ワールドマトリックス
//}Model;
//
////===========================================================================================================
//// プロトタイプ宣言
////===========================================================================================================
//void InitModel(void);
//void UninitModel(void);
//void UpdateModel(void);
//void DrawModel(void);
//Model *GetModel(void);
//
//#endif
